num = ["1", "2", "3", "5", "7", "8"]

alph = [["a", "e"], ["o"], ["i", "u"], ["n"],
        ["m"]]  # Order of priority to add tone

# In order of 1, 2, 3, 5, 7, 8
vowel_tone = [
    ["a", "á", "à", "â", "ā", "a̍"],
    ["e", "é", "è", "ê", "ē", "e̍"],
    ["i", "í", "ì", "î", "ī", "i̍"],
    ["u", "ú", "ù", "û", "ū", "u̍"],
    ["o", "ó", "ò", "ô", "ō", "o̍"],
    ["m", "ḿ", "m̀", "m̂", "m̄", "m̍"],
    ["n", "ń", "ǹ", "ň", "n̄", "n̍"],
]

consonants = [
    'p', 'ts', 't', 'ph', 'tsh', 'th', 'k', 'ch', 's', 'kh', 'chh', 'j', 'b',
    'l', 'd', 'g', 'h', 'n'
]

vowels = ['a', 'e', 'i', 'o', 'u']

match_lett = [['i', 'u', 'p', 'm', 't', 'k', 'nn', 'ng', 'un', 'in'],
              ['k', 'nn', 'ng'],
              ['a', 'o', 'u', 'p', 'm', 't', 'nn', 'an', 'on'],
              ['a', 'e', 'o', 'u', 'p', 'm', 'k', 'ng', 'un', 'an'],
              ['i', 't', 'nn', 'an', 'in']]
